## 📋 Plan: staging
```
time=2026-02-07T20:36:52Z level=info msg=The stack at /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecr
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-data

Group 2
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecs
- Module /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-cloudfront


time=2026-02-07T20:36:52Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/ecr into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecr/.terragrunt-cache/7Ei4bazsBJzBf2j1rhyaVFAmMxE/ZYY6zxql14w6khUN8KmUoQehwig prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecr] 
time=2026-02-07T20:36:52Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/s3-data into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-data/.terragrunt-cache/3PoqE4Rh5vwrLwVmMm7tel3jH2A/eLIvvGijZWtOfmBt3j9Qe_Jiahg prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-data] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.31.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_ecr_repository.backend: Refreshing state... [id=dgx-staging-backend]
time=2026-02-07T20:37:06Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/s3-cloudfront into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-cloudfront/.terragrunt-cache/xpQVcWZS3EEyUem8QhlApnFke4k/_oejbYqzjG2aKwkS6wQ7kGDcxD8 prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/s3-cloudfront] 
aws_ecr_lifecycle_policy.backend: Refreshing state... [id=dgx-staging-backend]
aws_s3_bucket.data: Refreshing state... [id=dgx-staging-data]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
aws_s3_bucket_public_access_block.data: Refreshing state... [id=dgx-staging-data]
aws_s3_bucket_versioning.data: Refreshing state... [id=dgx-staging-data]
aws_s3_bucket_cors_configuration.data: Refreshing state... [id=dgx-staging-data]
aws_s3_bucket_lifecycle_configuration.data: Refreshing state... [id=dgx-staging-data]

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/random v3.8.1...
- Installed hashicorp/random v3.8.1 (signed by HashiCorp)
- Installing hashicorp/aws v6.31.0...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
random_id.bucket: Refreshing state... [id=BHlSBg]
aws_s3_bucket.frontend: Refreshing state... [id=dgx-staging-frontend-04795206]
aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E37Y2IHSZMS89F]
aws_s3_bucket_versioning.frontend: Refreshing state... [id=dgx-staging-frontend-04795206]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=dgx-staging-frontend-04795206]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E1SUM37R1BNTQH]
aws_s3_bucket_policy.frontend: Refreshing state... [id=dgx-staging-frontend-04795206]

Changes to Outputs:
  ~ website_url                = "https://staging.wizioners.com" -> "https://staging-cms.wizioners.com"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2026-02-07T20:37:25Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/terraform/modules/ecs into /home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecs/.terragrunt-cache/OsWeM6oEjvORXqs7JIZ3SsTZ9nk/4cNQE_-WW6CeP7xxOpoG19Q-Gjc prefix=[/home/runner/work/tf-cms-digix/tf-cms-digix/terragrunt/environments/staging/ecs] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:746393610736:cluster/dgx-staging-cluster]
aws_iam_role.ecs_task: Refreshing state... [id=dgx-staging-ecs-task-role]
aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/dgx-staging]
aws_iam_role.ecs_task_execution: Refreshing state... [id=dgx-staging-ecs-exec-role]
aws_security_group.ecs: Refreshing state... [id=sg-08709dbc8fc9d491d]
aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=dgx-staging-ecs-exec-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.ecs_ssm: Refreshing state... [id=dgx-staging-ecs-exec-role:dgx-staging-ecs-ssm]
aws_iam_role_policy.ecs_s3: Refreshing state... [id=dgx-staging-ecs-task-role:dgx-staging-ecs-s3]
aws_ecs_task_definition.main: Refreshing state... [id=dgx-staging-backend]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:746393610736:service/dgx-staging-cluster/dgx-staging-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-2:746393610736:task-definition/dgx-staging-backend:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:746393610736:task-definition/dgx-staging-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        {
                            name  = "AWS_REGION"
                            value = "us-east-2"
                        },
                      + {
                          + name  = "CORS_ORIGINS"
                          + value = "https://staging-cms.wizioners.com,http://localhost:3000"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        # (8 unchanged elements hidden)
                    ]
                  - mountPoints      = []
                    name             = "backend"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8005
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "dgx-staging-backend" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "Name" = "dgx-staging-backend-task"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```